Para criar o banco de dados no PostgreSQL use o arquivo Projeto_SQL.sql para criar o database Projeto_Postgres

In [12]:
import pandas as pd

In [16]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\mauri\anaconda3\lib\site-packages (2.0.25)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\mauri\anaconda3\lib\site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\mauri\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [18]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\mauri\anaconda3\lib\site-packages (2.9.9)

In [19]:
from sqlalchemy import create_engine

In [20]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "********"
HOST = "localhost"
DATABASE = "Projeto_Postgres"

In [21]:

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}:5432/{DATABASE}")
engine.connect()

In [ ]:

engine = create_engine('postgresql+psycopg2://postgres:senha@localhost/postgres')
conn = engine.connect()

In [24]:
pd.read_sql_query("SELECT * FROM item_dim", con = engine)

,item_key,item_name,descr,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans
...,...,...,...,...,...,...,...
259,I00260,Napkins Square Lunch,Kitchen Supplies,15.00,Cambodia,NINGBO SEDUNO IMP & EXP CO.LTD,ct
260,I00261,POM 2 ply paper towels,Kitchen Supplies,33.00,Lithuania,BIGSO AB,ct
261,I00262,Strong Everyday Napkins,Kitchen Supplies,14.00,Netherlands,Bolsius Boxmeer,ct
262,I00263,Advil 2 pill packets,Medicine,14.00,Lithuania,BIGSO AB,Ct
263,I00264,Tylenol Extra Strength 2 pill packets,Medicine,15.00,India,Indo Count Industries Ltd,Ct

1. Obter o nome das tabelas "criadas" no db ativo:

In [72]:
pd.read_sql_query("SELECT table_name, table_schema FROM INFORMATION_SCHEMA.TABLES WHERE table_schema = 'public' ", con = engine)

     table_name table_schema
0     trans_dim       public
1  customer_dim       public
2    fact_table       public
3      time_dim       public
4      item_dim       public
5     store_dim       public

In [107]:
tabelas = pd.read_sql_query("SELECT table_name, table_schema FROM INFORMATION_SCHEMA.TABLES WHERE table_schema = 'public' ", con = engine)

In [110]:
print(tabelas.table_name)

0       trans_dim
1    customer_dim
2      fact_table
3        time_dim
4        item_dim
5       store_dim
Name: table_name, dtype: object

2. Obter as informações de nome da coluna, tipo de dado e máximo número de carcteres (no caso de string):

In [56]:
pd.read_sql_query("SELECT column_name, data_type, character_maximum_length FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'item_dim'", con = engine)

   column_name          data_type  character_maximum_length
0   unit_price            numeric                       NaN
1    item_name  character varying                     128.0
2        descr  character varying                     128.0
3     item_key  character varying                       6.0
4  man_country  character varying                     128.0
5     supplier  character varying                     128.0
6         unit  character varying                      32.0

3. Mesmo do anterior, mas para todas as tabelas:

In [167]:
for tabela in tabelas.table_name:
    query = ""f'SELECT column_name, data_type, character_maximum_length FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = \'{tabela}\''""
    print(tabela)
    print(pd.read_sql_query(query, con = engine))
    print(" ")

trans_dim
   column_name          data_type  character_maximum_length
0  payment_key  character varying                         6
1   trans_type  character varying                        32
2    bank_name  character varying                       128

customer_dim
    column_name          data_type  character_maximum_length
0  customer_key  character varying                         8
1         name_  character varying                        64
2    contact_no  character varying                        16
3           nid  character varying                        16

fact_table
    column_name          data_type  character_maximum_length
0      quantity           smallint                       NaN
1    unit_price            numeric                       NaN
2   total_price            numeric                       NaN
3      item_key  character varying                       6.0
4   payment_key  character varying                       6.0
5          unit  character varying                      12.0
6     store_key  character varying                     128.0
7  customer_key  character varying                       8.0
8      time_key  character varying                       8.0

time_dim
  column_name                    data_type  character_maximum_length
0       date_  timestamp without time zone                       NaN
1       hour_                     smallint                       NaN
2        day_                     smallint                       NaN
3       year_                     smallint                       NaN
4        week            character varying                       8.0
5    time_key            character varying                       8.0
6      month_            character varying                       2.0
7     quarter            character varying                       2.0

item_dim
   column_name          data_type  character_maximum_length
0   unit_price            numeric                       NaN
1    item_name  character varying                     128.0
2        descr  character varying                     128.0
3     item_key  character varying                       6.0
4  man_country  character varying                     128.0
5     supplier  character varying                     128.0
6         unit  character varying                      32.0

store_dim
  column_name          data_type  character_maximum_length
0   store_key  character varying                         8
1    division  character varying                       128
2    district  character varying                       128
3     upazila  character varying                       128

In [ ]:
4. Obter as informações de nome da coluna, tipo de dado e máximo número de carcteres (no caso de string):

In [57]:
pd.read_sql_query("SELECT column_name, data_type, character_maximum_length FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'fact_table'", con = engine)

    column_name          data_type  character_maximum_length
0      quantity           smallint                       NaN
1    unit_price            numeric                       NaN
2   total_price            numeric                       NaN
3      item_key  character varying                       6.0
4   payment_key  character varying                       6.0
5          unit  character varying                      12.0
6     store_key  character varying                     128.0
7  customer_key  character varying                       8.0
8      time_key  character varying                       8.0

5. Obter o numero de linhas da tabela "store_dim"

In [58]:
pd.read_sql_query("SELECT COUNT(*) FROM store_dim", con = engine)

   count
0    726

In [ ]:
6. Verificar se tem um campo Null em uma coluna:

In [75]:
pd.read_sql_query("SELECT upazila FROM store_dim WHERE upazila IS NULL LIMIT 10", con = engine)

Empty DataFrame
Columns: [upazila]
Index: []

ou para contar os nulls:

In [166]:
pd.read_sql_query("SELECT COUNT(*) AS QTD FROM store_dim WHERE upazila IS NULL LIMIT 10", con = engine)

   qtd
0    0

7. Juntando as tabelas:

In [76]:
pd.read_sql_query("SELECT * FROM fact_table JOIN customer_dim ON fact_table.customer_key = customer_dim.customer_key LIMIT 10", con = engine)

,payment_key,customer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price,customer_key,name_,contact_no,nid
0,P026,C004510,T049189,I00177,S00307,1,ct,35.00,35.00,C004510,priya,8801529462805,4543429591184
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.00,26.00,C008967,harpreet kaur,8801985295010,9673146002795
2,P030,C007261,T03633,I00195,S00496,8,ct,12.50,100.00,C007261,sonam,8801955748165,2335742897063
3,P032,C007048,T084631,I00131,S0086,8,ct,14.00,112.00,C007048,rekha bai,8801927509185,4943555261118
4,P014,C006430,T071276,I00050,S00488,8,cans,8.00,64.00,C006430,mamta devi,8801549045065,3602133066555
5,P006,C007574,T026950,I00058,S00328,5,bottles,22.00,110.00,C007574,saraswati thapa,8801981952895,9576091314479
6,P023,C005695,T096704,I00075,S00196,2,cans,15.50,31.00,C005695,barakha,8801941626337,4780212775371
7,P027,C008728,T010756,I00188,S0010,1,ct,14.00,14.00,C008728,aarti,8801851519327,3730343221821
8,P025,C002764,T017598,I00017,S00164,11,cans,6.75,74.25,C002764,manormapal,8801632373289,8964236429484
9,P019,C003128,T048812,I00133,S00640,10,ct,15.00,150.00,C003128,rekha,8801760484770,9263631436592

8. Juntando tres tabelas:

In [101]:
query = """SELECT * 
           FROM fact_table 
           JOIN customer_dim ON fact_table.customer_key = customer_dim.customer_key
           JOIN item_dim ON fact_table.item_key = item_dim.item_key
           """

Mesmo resultado neste caso se usar, (relação 1:1):

In [105]:
query = """SELECT * 
           FROM fact_table 
           LEFT JOIN customer_dim ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim ON fact_table.item_key = item_dim.item_key
           """

In [106]:
pd.read_sql_query(query, con = engine)

,payment_key,customer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price,customer_key,name_,contact_no,nid,item_key,item_name,descr,unit_price,man_country,supplier,unit
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0,C004510,priya,8801529462805,4543429591184,I00177,M&M Peanut Candy 1.7 oz,Food - Chocolate,35.0,Netherlands,Bolsius Boxmeer,ct
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0,C008967,harpreet kaur,8801985295010,9673146002795,I00248,Charmin Ultra Bath Tissue,Kitchen Supplies,26.0,Bangladesh,DENIMACH LTD,rolls
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0,C007261,sonam,8801955748165,2335742897063,I00195,Dole Fruit in Gel Cups 4.3 oz,Food - Healthy,12.5,poland,CHROMADURLIN S.A.S,ct
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0,C007048,rekha bai,8801927509185,4943555261118,I00131,Paper Bowls 20 oz Ultra Strong,Dishware - Bowls,14.0,Bangladesh,DENIMACH LTD,ct
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0,C006430,mamta devi,8801549045065,3602133066555,I00050,Waterloo Sparkling Watermelon 12oz,a. Beverage Sparkling Water,8.0,poland,CHROMADURLIN S.A.S,cans
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,P010,C003726,T09247,I00063,S00502,5,cans,40.0,200.0,C003726,shahin,8801949680465,1338702506322,I00063,Red Bull 8.4 oz,Beverage - Energy/Protein,40.0,Lithuania,BIGSO AB,cans
999996,P021,C002581,T023483,I00252,S00225,1,ct,11.0,11.0,C002581,shiba,8801625838834,3984794865442,I00252,Dial Anti-bacterial Foam 7.5oz,Kitchen Supplies,11.0,Bangladesh,DENIMACH LTD,ct
999997,P035,C006133,T039372,I00119,S00555,7,ct,53.0,371.0,C006133,pushpa devi,8801726252679,9549620549026,I00119,K Cups Original Donut Shop Med. Roast,Coffee K-Cups,53.0,India,Indo Count Industries Ltd,ct
999998,P031,C008735,T097975,I00257,S00440,2,ct,21.0,42.0,C008735,rizwana,8801911363469,6638207380530,I00257,Large Trash Bags Black 33 gal,Kitchen Supplies,21.0,Bangladesh,DENIMACH LTD,ct
999999,P032,C004067,T018028,I00044,S00326,10,cans,8.0,80.0,C004067,nirmla,8801995402206,8284100142305,I00044,Waterloo Sparkling Blackcherry 12oz,a. Beverage Sparkling Water,8.0,Cambodia,NINGBO SEDUNO IMP & EXP CO.LTD,cans

9. Juntando todas tabelas:e_dim

In [171]:
query = """SELECT * 
           FROM fact_table 
           LEFT JOIN customer_dim ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim ON fact_table.item_key = item_dim.item_key
           LEFT JOIN trans_dim ON fact_table.payment_key = trans_dim.payment_key
           LEFT JOIN store_dim ON fact_table.store_key = store_dim.store_key
           LEFT JOIN time_dim ON fact_table.time_key = time_dim.time_key
           """

In [172]:
pd.read_sql_query(query, con = engine)

,payment_key,customer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price,customer_key,...,district,upazila,time_key,date_,hour_,day_,week,month_,quarter,year_
0,P026,C004510,T049189,I00177,S00307,1,ct,35.00,35.00,C004510,...,JAMALPUR,ISLAMPUR,T049189,2016-04-26 17:13:00,17,26,4th Week,04,Q2,2016
1,P032,C007048,T084631,I00131,S0086,8,ct,14.00,112.00,C007048,...,RANGPUR,KAUNIA,T084631,2020-02-01 06:00:00,6,1,1st Week,02,Q1,2020
2,P023,C005695,T096704,I00075,S00196,2,cans,15.50,31.00,C005695,...,KHULNA,DACOPE,T096704,2019-12-17 01:12:00,1,17,3rd Week,12,Q4,2019
3,P027,C008728,T010756,I00188,S0010,1,ct,14.00,14.00,C008728,...,MAULVIBAZAR,JURI,T010756,2017-11-16 07:07:00,7,16,3rd Week,11,Q4,2017
4,P025,C002764,T017598,I00017,S00164,11,cans,6.75,74.25,C002764,...,SIRAJGANJ,SHAHJADPUR,T017598,2016-10-16 05:49:00,5,16,3rd Week,10,Q4,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,P033,C001921,T077695,I00039,S00524,11,bottles,26.00,286.00,C001921,...,BARISAL,BANARI PARA,T077695,2019-01-25 14:39:00,14,25,4th Week,01,Q1,2019
999996,P010,C003726,T09247,I00063,S00502,5,cans,40.00,200.00,C003726,...,NOAKHALI,SONAIMURI,T09247,2020-07-22 23:42:00,23,22,4th Week,07,Q3,2020
999997,P021,C002581,T023483,I00252,S00225,1,ct,11.00,11.00,C002581,...,SATKHIRA,ASSASUNI,T023483,2020-01-19 02:07:00,2,19,3rd Week,01,Q1,2020
999998,P035,C006133,T039372,I00119,S00555,7,ct,53.00,371.00,C006133,...,PIROJPUR,NESARABAD (SWARUPKATI),T039372,2017-10-27 09:52:00,9,27,4th Week,10,Q4,2017
999999,P031,C008735,T097975,I00257,S00440,2,ct,21.00,42.00,C008735,...,CHITTAGONG,KOTWALI,T097975,2014-06-09 04:12:00,4,9,2nd Week,06,Q2,2014

In [183]:
query = """SELECT count(*) AS "Total de Linhas"
           FROM fact_table 
           LEFT JOIN customer_dim ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim ON fact_table.item_key = item_dim.item_key
           LEFT JOIN trans_dim ON fact_table.payment_key = trans_dim.payment_key
           LEFT JOIN store_dim ON fact_table.store_key = store_dim.store_key
           LEFT JOIN time_dim ON fact_table.time_key = time_dim.time_key
           """

In [184]:
pd.read_sql_query(query, con = engine)

   Total de Linhas
0          1000000

Perguntas do negócio:

1. Quais são os fornecedores que aparecem na coluna "supplier" da tabela "item_dim"

In [27]:
pd.read_sql_query("SELECT DISTINCT supplier FROM item_dim", con = engine)

                         supplier
0                        BIGSO AB
1            CHERRY GROUP CO.,LTD
2       Indo Count Industries Ltd
3  NINGBO SEDUNO IMP & EXP CO.LTD
4                     HARDFORD AB
5              Friedola 1888 GmbH
6                       MAESA SAS
7                 Bolsius Boxmeer
8                    DENIMACH LTD
9              CHROMADURLIN S.A.S

2. Quais são os paises de manufatura que aparecem na coluna "man_country" da tabela "item_dim" em ordem alfabética?

In [33]:
pd.read_sql_query("SELECT DISTINCT man_country FROM item_dim ORDER BY man_country", con = engine)

     man_country
0     Bangladesh
1       Cambodia
2          China
3        Finland
4        Germany
5          India
6      Lithuania
7    Netherlands
8         poland
9  United States

3. Quais são o maior e o menor preço unitário coluna "unit_price" da tabela "item_dim"

In [36]:
pd.read_sql_query("SELECT MAX(unit_price), MIN(unit_price) FROM item_dim", con = engine)

    max  min
0  55.0  6.0

In [ ]:
4. Qual o valor médio do preço unitário coluna "unit_price" da tabela "item_dim", com duas casas decimais.

In [38]:
pd.read_sql_query("SELECT ROUND(AVG(unit_price),2) FROM item_dim", con = engine)

   round
0  17.55

5. Qual o valor médio do preço unitário coluna "unit_price" da tabela "item_dim", com duas casas decimais por categoria ("descr") em ordem crescente de valor da média.

In [42]:
pd.read_sql_query("SELECT ROUND(AVG(unit_price),2), descr FROM item_dim GROUP BY descr ORDER BY ROUND(AVG(unit_price),2)", con = engine)

    round                        descr
0    9.00            Coffee K-Cups Tea
1    9.86           a. Beverage - Soda
2   12.00                 Coffee Cream
3   12.72               Beverage Water
4   12.90                Food - Snacks
5   13.50                  Gum - Mints
6   14.00             Dishware - Bowls
7   14.18                Food - Sweets
8   14.50                     Medicine
9   15.00         Dishware - Cups Cold
10  15.00          Dishware - Utensils
11  15.00             Coffee Hot Cocoa
12  15.25               Coffee Creamer
13  15.71  a. Beverage Sparkling Water
14  15.81               Food - Healthy
15  16.24                 Food - Chips
16  16.29          Beverage - Iced Tea
17  16.42                  Food - Nuts
18  16.43             Beverage - Juice
19  17.00              Coffee Stirrers
20  17.42            Dishware - Plates
21  18.05          Beverage - Gatorade
22  18.30                Coffee Ground
23  19.39             Kitchen Supplies
24  20.19             Coffee Sweetener
25  21.21             Food - Chocolate
26  23.00   Beverage - Energy/Protein
27  23.75          Dishware - Cups Hot
28  34.31    Beverage - Energy/Protein
29  46.86                Coffee K-Cups

Uma outra forma de fazer a mesma query:

In [53]:
query = """ SELECT 
                ROUND(AVG(unit_price),2), 
                descr 
            FROM item_dim 
            GROUP BY descr 
            ORDER BY ROUND(AVG(unit_price),2)"""

In [54]:
pd.read_sql_query(query, con = engine)

    round                        descr
0    9.00            Coffee K-Cups Tea
1    9.86           a. Beverage - Soda
2   12.00                 Coffee Cream
3   12.72               Beverage Water
4   12.90                Food - Snacks
5   13.50                  Gum - Mints
6   14.00             Dishware - Bowls
7   14.18                Food - Sweets
8   14.50                     Medicine
9   15.00         Dishware - Cups Cold
10  15.00          Dishware - Utensils
11  15.00             Coffee Hot Cocoa
12  15.25               Coffee Creamer
13  15.71  a. Beverage Sparkling Water
14  15.81               Food - Healthy
15  16.24                 Food - Chips
16  16.29          Beverage - Iced Tea
17  16.42                  Food - Nuts
18  16.43             Beverage - Juice
19  17.00              Coffee Stirrers
20  17.42            Dishware - Plates
21  18.05          Beverage - Gatorade
22  18.30                Coffee Ground
23  19.39             Kitchen Supplies
24  20.19             Coffee Sweetener
25  21.21             Food - Chocolate
26  23.00   Beverage - Energy/Protein
27  23.75          Dishware - Cups Hot
28  34.31    Beverage - Energy/Protein
29  46.86                Coffee K-Cups

6. Quantas compras com itens de 'Food - Healthy' cada consumidor (customer_key	) realizou?

In [164]:
query = """SELECT customer_dim.customer_key, name_, COUNT(customer_dim.customer_key)
           FROM fact_table 
           LEFT JOIN customer_dim 
               ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim 
               ON fact_table.item_key = item_dim.item_key
           WHERE item_dim.descr = 'Food - Healthy'
           GROUP BY customer_dim.customer_key
           ORDER BY COUNT(customer_dim.customer_key) DESC
           """

In [165]:
pd.read_sql_query(query, con = engine)

     customer_key          name_  count
0         C003361         nirmla     27
1         C000719         monika     25
2         C006165  jasina khatun     25
3         C001173         anjali     25
4         C000786        aashiya     24
...           ...            ...    ...
9186      C004170        kaushar      3
9187      C001657           None      3
9188      C001184      jamrujaha      3
9189      C002309      smt sanju      2
9190      C003417          ganga      1

[9191 rows x 3 columns]

7. Calcule o ticket médio por cliente

In [193]:
query = """SELECT customer_dim.customer_key, name_, ROUND(AVG(fact_table.total_price),2)
           FROM fact_table 
           LEFT JOIN customer_dim 
               ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim 
               ON fact_table.item_key = item_dim.item_key
           GROUP BY customer_dim.customer_key
           ORDER BY ROUND(AVG(fact_table.total_price),2) DESC
           """

In [194]:
pd.read_sql_query(query, con = engine)

     customer_key        name_   round
0         C008009        neetu  137.24
1         C007831   sundri bai  136.96
2         C001673         asha  136.19
3         C000603   azhar  ali  135.52
4         C004220  lata kumari  134.78
...           ...          ...     ...
9186      C005583     khushabu   81.73
9187      C002385       soniya   80.92
9188      C005059        meena   80.78
9189      C000140       ram ji   80.68
9190      C007901     priyanka   80.51

[9191 rows x 3 columns]

8. Calcule o ticket médio por cliente na categoria 'Kitchen Supplies'

In [195]:
query = """SELECT customer_dim.customer_key, name_, ROUND(AVG(fact_table.total_price),2)
           FROM fact_table 
           LEFT JOIN customer_dim 
               ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim 
               ON fact_table.item_key = item_dim.item_key
           WHERE item_dim.descr = 'Kitchen Supplies'
           GROUP BY customer_dim.customer_key
           ORDER BY ROUND(AVG(fact_table.total_price),2) DESC
           """

In [196]:
pd.read_sql_query(query, con = engine)

     customer_key                name_   round
0         C008130          nirjla devi  297.00
1         C006596    soam chokeyiyakra  262.00
2         C000226        naval kishore  253.50
3         C008175               gitika  248.50
4         C006777              shamina  245.50
...           ...                  ...     ...
9185      C007135             tabbasum   35.00
9186      C004219                meenu   32.00
9187      C002794                laxmi   29.67
9188      C003772         chand kunwar   16.00
9189      C002756  firdosh bano @ asha   16.00

[9190 rows x 3 columns]

9. Calcule o ticket médio categoria e o número de vendas por categoria, ordenw pelo ticket médio

In [203]:
query = """SELECT item_dim.descr, ROUND(AVG(fact_table.total_price),2) AS "Ticket Médio", count(customer_dim.customer_key) AS QTD
           FROM fact_table 
           LEFT JOIN customer_dim 
               ON fact_table.customer_key = customer_dim.customer_key
           LEFT JOIN item_dim 
               ON fact_table.item_key = item_dim.item_key
           GROUP BY item_dim.descr
           ORDER BY ROUND(AVG(fact_table.total_price),2) DESC
           """

In [204]:
pd.read_sql_query(query, con = engine)

                          descr  Ticket Médio     qtd
0                 Coffee K-Cups        281.06   26671
1     Beverage - Energy/Protein        207.67   49300
2           Dishware - Cups Hot        142.77   22834
3    Beverage - Energy/Protein         137.67    3625
4              Food - Chocolate        126.80   52758
5              Coffee Sweetener        120.50   30511
6              Kitchen Supplies        116.47   72416
7                 Coffee Ground        110.22   18901
8           Beverage - Gatorade        108.13   37713
9             Dishware - Plates        104.73   22538
10              Coffee Stirrers        102.54    3769
11                  Food - Nuts         98.86   22846
12             Beverage - Juice         98.24   26865
13          Beverage - Iced Tea         97.48   26517
14                 Food - Chips         97.36   79676
15               Food - Healthy         94.71  109585
16  a. Beverage Sparkling Water         94.04   79353
17               Coffee Creamer         91.50    7584
18             Coffee Hot Cocoa         90.54    7585
19         Dishware - Cups Cold         90.18   11369
20          Dishware - Utensils         89.83   11206
21                     Medicine         87.67    7575
22                Food - Sweets         85.14   41747
23             Dishware - Bowls         84.43    7547
24                  Gum - Mints         80.99   30237
25                Food - Snacks         76.98   18942
26               Beverage Water         76.52   34173
27                 Coffee Cream         71.73   22702
28           a. Beverage - Soda         59.21  109741
29            Coffee K-Cups Tea         54.17    3714

In [ ]:
10. Conte o número de transações por ano:

In [211]:
query = """ SELECT 
                year_, COUNT(time_dim.time_key) AS QTD
            FROM time_dim 
            GROUP BY year_
            ORDER BY year_
            LIMIT 100"""

In [212]:
pd.read_sql_query(query, con = engine)

   year_    qtd
0   2014  13560
1   2015  14294
2   2016  14239
3   2017  14357
4   2018  14315
5   2019  14240
6   2020  14160
7   2021    834